app/controllers/coordinators_controller.rb

  def index
    @coordinators = Coordinator.all
---
SELECT * FROM "coordinators"

  def show
    @coordinator = Coordinator.find(params[:id])
---
SELECT * FROM "coordinators" WHERE ("coordinators"."id" = 1)

  def create
    @coordinator = Coordinator.new(params[:coordinator])

    respond_to do |format|
      if @coordinator.save
---
INSERT INTO "coordinators" ("name", "skype", "created_at", "notes", "updated_at", "phone", "email") VALUES('Peter', 'asdf', '2010-06-13 19:41:12', 'asdfadsf', '2010-06-13 19:41:12', 'asdf', 'peter@asdf.com')